In [38]:
import pandas as pd

df = pd.read_csv("dup_df.cvs")

In [39]:
df.drop("Unnamed: 0",axis=1,inplace=True)

In [40]:
df.head()

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   22
3   4    David   35
4   5      Eve   28

# Identifying Duplicate Rows:

In [41]:
df.duplicated().sum()

2

# Identifying duplicate rows based on all columns

In [42]:
df[df.duplicated(subset=['ID','Age'])]

    ID   Name  Age
5    1  Alice   25
11   2    Bob   30

# Removing Duplicate Rows:

# Removing all duplicate rows

In [45]:
df.drop_duplicates() #inplace=True

    ID     Name  Age
0    1    Alice   25
1    2      Bob   30
2    3  Charlie   22
3    4    David   35
4    5      Eve   28
6    6    Frank   40
7    7    Grace   32
8    8   Hannah   29
9    9      Ivy   27
10  10     Jack   33

# Removing duplicate rows based on specific columns (e.g., 'ID' and 'Name')

In [46]:
df.drop_duplicates(subset=['ID','Name'])

    ID     Name  Age
0    1    Alice   25
1    2      Bob   30
2    3  Charlie   22
3    4    David   35
4    5      Eve   28
6    6    Frank   40
7    7    Grace   32
8    8   Hannah   29
9    9      Ivy   27
10  10     Jack   33

# Keep the first occurrence of each duplicated row and remove the rest

In [48]:
df.drop_duplicates(keep='first')

    ID     Name  Age
0    1    Alice   25
1    2      Bob   30
2    3  Charlie   22
3    4    David   35
4    5      Eve   28
6    6    Frank   40
7    7    Grace   32
8    8   Hannah   29
9    9      Ivy   27
10  10     Jack   33

# Keep the last occurrence of each duplicated row and remove the rest

In [49]:
df.drop_duplicates(keep='last')

    ID     Name  Age
2    3  Charlie   22
3    4    David   35
4    5      Eve   28
5    1    Alice   25
6    6    Frank   40
7    7    Grace   32
8    8   Hannah   29
9    9      Ivy   27
10  10     Jack   33
11   2      Bob   30

# Counting Duplicates Based on Specific Columns:

In [22]:
# Count the number of duplicates based on specific columns (e.g., 'ID' and 'Name')
df.duplicated(subset=['ID', 'Name']).sum()

2

In [52]:
df.duplicated(subset=['ID','Name']).sum()

2